devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
/*=========================================================================*//**
@file    i2c.c

@author  Daniel Zorychta

@brief   This driver support I2C peripherals.

@note    Copyright (C) 2014  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

// NOTE: 10-bit addressing mode is experimental and not tested!

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include "stm32f1/i2c_cfg.h"
#include "stm32f1/i2c_def.h"
#include "stm32f1/stm32f10x.h"
#include "lib/stm32f10x_rcc.h"


#include "stm32f1/gpio_macros.h"
#include "stm32f1/gpio_cfg.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
/// macro used to simplify configuration of particular device
#define I2C_DEV_CFG(_major, _minor)\
{\
        .addr          = _major##_DEV_##_minor##_ADDRESS,\
        .addr10bit     = _major##_DEV_##_minor##_10BIT_ADDR_MODE,\
        .sub_addr_mode = _major##_DEV_##_minor##_SEND_SUB_ADDRESS,\
        .major         = _major,\
        .minor         = _minor\
}

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/// type defines possible modes of sub-addressing sequence (used e.g. in EEPROM)
typedef enum {
        I2C_SUB_ADDR_MODE__DISABLED = 0,                //!< sub-addressing disabled
        I2C_SUB_ADDR_MODE__1_BYTE   = 1,                //!< sub-address is 1 byte long
        I2C_SUB_ADDR_MODE__2_BYTES  = 2,                //!< sub-address is 2 byte long
        I2C_SUB_ADDR_MODE__3_BYTES  = 3                 //!< sub-address is 3 byte long
} I2C_sub_addr_mode_t;

/// type defines state of state machine implemented in the IRQ that controls data flow
typedef enum {
        STATE_IDLE,                                     //!< state used when IRQ is disabled
        STATE_START,                                    //!< I2C start or repeated start sequence done
        STATE_ADDRESS_HEADER_SENT,                      //!< 10-bit address mode header sent
        STATE_ADDRESS_SENT,                             //!< 7- or 10-bit address sent
        STATE_SUB_ADDRESS,                              //!< sub-address send state
        STATE_TRANSFER                                  //!< data transfer (tx/rx and DMA)
} state_t;

/// type defines single device configuration connected to the specified I2C peripheral
typedef struct {
        const u16_t               addr:16;              //!< address of device (7- or 10-bit)
        const bool                addr10bit:1;          //!< 10-bit mode addressing (true)
        const I2C_sub_addr_mode_t sub_addr_mode:2;      //!< mode of sub-address (0, 1, 2, or 3 byte)
        const u8_t                major:4;              //!< major number of the device (I2C peripheral number)
        const u8_t                minor:4;              //!< minor number of the device (device identifier)
} I2C_dev_config_t;

/// type defines configuration of single I2C peripheral
typedef struct {
        #if ((_I2C1_ENABLE > 0) && (_I2C1_USE_DMA > 0)) || ((_I2C2_ENABLE > 0) && (_I2C2_USE_DMA > 0))
        const bool              use_DMA;                //!< peripheral uses DMA and IRQ (true), or only IRQ (false)
        const DMA_Channel_t    *const DMA_tx;           //!< pointer to the DMA Tx channel peripheral
        const DMA_Channel_t    *const DMA_rx;           //!< pointer to the DMA Rx channel peripheral
        const u8_t              DMA_tx_number:4;        //!< number of channel of DMA Tx
        const u8_t              DMA_rx_number:4;        //!< number of channel of DMA Rx
        const IRQn_Type         DMA_tx_IRQ_n;           //!< number of interrupt in the vector table
        const IRQn_Type         DMA_rx_IRQ_n;           //!< number of interrupt in the vector table
        #endif
        const I2C_t            *const I2C;              //!< pointer to the I2C peripheral
        const I2C_dev_config_t *const devices;          //!< pointer to devices' configuration table
        const u32_t             freq;                   //!< peripheral SCL frequency [Hz]
        const u32_t             APB1ENR_clk_mask;       //!< mask used to enable I2C clock in the APB1ENR register
        const u8_t              IRQ_prio;               //!< priority of IRQ (event, error, and DMA)
        const IRQn_Type         IRQ_EV_n;               //!< number of event IRQ vector
        const IRQn_Type         IRQ_ER_n;               //!< number of error IRQ vector
} I2C_config_t;

/// type defines I2C device in the runtime environment
typedef struct {
        const I2C_dev_config_t *config;                 //!< pointer to the device configuration
        dev_lock_t              lock;                   //!< object used to lock access to opened device
        u16_t                   address;                //!< device address
} I2C_dev_t;

/// type defines main memory of this module
typedef struct {
        struct I2C_per {
                mutex_t            *lock;               //!< mutex used to lock access to the particular peripheral
                sem_t              *event;              //!< semaphore used to indicate event (operation finished)
                u16_t               SR1_mask;           //!< SR1 register mask (to catch specified event in IRQ)
                bool                use_DMA:1;          //!< true if peripheral use DMA channels
                bool                initialized:1;      //!< indicates that module for this peripheral is initialized
                u8_t                dev_cnt;            //!< number of initialized devices
                u8_t                error;              //!< error number (errno)
                u8_t                unexp_event_cnt;    //!< number of unexpected events
        } periph[_I2C_NUMBER_OF_PERIPHERALS];
} I2C_mem_t;


/*==============================================================================
  Local function prototypes
==============================================================================*/
static void release_resources(u8_t major);
static inline I2C_t *get_I2C(I2C_dev_t *hdl);
static bool enable_I2C(u8_t major);
static void disable_I2C(u8_t major);
static bool start(I2C_dev_t *hdl);
static void stop(I2C_dev_t *hdl);
static bool send_address(I2C_dev_t *hdl, bool write);
static void clear_send_address_event(I2C_dev_t *hdl);
static bool send_subaddress(I2C_dev_t *hdl, u32_t address, I2C_sub_addr_mode_t mode);
static void set_ACK_according_to_reception_size(I2C_dev_t *hdl, size_t count);
static ssize_t receive(I2C_dev_t *hdl, u8_t *dst, size_t count);
static void IRQ_EV_handler(u8_t major);
static void IRQ_ER_handler(u8_t major);

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME(I2C);

static const uint access_timeout    = 30000;
static const uint device_timeout    = 2000;
static const u8_t header_addr_10bit = 0xF0;

/// configuration of devices of I2C1 peripheral
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
static const I2C_dev_config_t I2C1_dev_cfg[_I2C1_NUMBER_OF_DEVICES] = {
        #if (_I2C1_NUMBER_OF_DEVICES >= 1)
        I2C_DEV_CFG(_I2C1, 0),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 2)
        I2C_DEV_CFG(_I2C1, 1),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 3)
        I2C_DEV_CFG(_I2C1, 2),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 4)
        I2C_DEV_CFG(_I2C1, 3),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 5)
        I2C_DEV_CFG(_I2C1, 4),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 6)
        I2C_DEV_CFG(_I2C1, 5),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 7)
        I2C_DEV_CFG(_I2C1, 6),
        #endif
        #if (_I2C1_NUMBER_OF_DEVICES >= 8)
        I2C_DEV_CFG(_I2C1, 7),
        #endif
};
#endif

/// configuration of devices of I2C2 peripheral
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
static const I2C_dev_config_t I2C2_dev_cfg[_I2C2_NUMBER_OF_DEVICES] = {
        #if (_I2C2_NUMBER_OF_DEVICES >= 1)
        I2C_DEV_CFG(_I2C2, 0),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 2)
        I2C_DEV_CFG(_I2C2, 1),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 3)
        I2C_DEV_CFG(_I2C2, 2),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 4)
        I2C_DEV_CFG(_I2C2, 3),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 5)
        I2C_DEV_CFG(_I2C2, 4),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 6)
        I2C_DEV_CFG(_I2C2, 5),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 7)
        I2C_DEV_CFG(_I2C2, 6),
        #endif
        #if (_I2C2_NUMBER_OF_DEVICES >= 8)
        I2C_DEV_CFG(_I2C2, 7),
        #endif
};
#endif

/// peripherals configuration
static const I2C_config_t I2C_cfg[_I2C_NUMBER_OF_PERIPHERALS] = {
        #if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
        {
                #if ((_I2C1_ENABLE > 0) && (_I2C1_USE_DMA > 0)) || ((_I2C2_ENABLE > 0) && (_I2C2_USE_DMA > 0))
                .use_DMA          = _I2C1_USE_DMA,
                .DMA_tx           = DMA1_Channel6,
                .DMA_rx           = DMA1_Channel7,
                .DMA_tx_number    = 6,
                .DMA_rx_number    = 7,
                .DMA_tx_IRQ_n     = DMA1_Channel6_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Channel7_IRQn,
                #endif
                .I2C              = I2C1,
                .freq             = _I2C1_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C1EN,
                .IRQ_prio         = _I2C1_IRQ_PRIO,
                .IRQ_EV_n         = I2C1_EV_IRQn,
                .IRQ_ER_n         = I2C1_ER_IRQn,
                .devices          = I2C1_dev_cfg
        },
        #endif
        #if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
        {
                #if ((_I2C1_ENABLE > 0) && (_I2C1_USE_DMA > 0)) || ((_I2C2_ENABLE > 0) && (_I2C2_USE_DMA > 0))
                .use_DMA          = _I2C2_USE_DMA,
                .DMA_tx           = DMA1_Channel4,
                .DMA_rx           = DMA1_Channel5,
                .DMA_tx_number    = 4,
                .DMA_rx_number    = 5,
                .DMA_tx_IRQ_n     = DMA1_Channel4_IRQn,
                .DMA_rx_IRQ_n     = DMA1_Channel5_IRQn,
                #endif
                .I2C              = I2C2,
                .freq             = _I2C2_FREQUENCY,
                .APB1ENR_clk_mask = RCC_APB1ENR_I2C2EN,
                .IRQ_prio         = _I2C2_IRQ_PRIO,
                .IRQ_EV_n         = I2C2_EV_IRQn,
                .IRQ_ER_n         = I2C2_ER_IRQn,
                .devices          = I2C2_dev_cfg
        },
        #endif
};

/// main memory of module
static I2C_mem_t *I2C;

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(I2C, void **device_handle, u8_t major, u8_t minor)
{
        if (major >= _I2C_NUMBER_OF_PERIPHERALS) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }

